


public class Main {

    public static void main(String[] args) {
        /*    /* Объявите переменные name1, name2, name3 типа String.
            Сразу же в строке объявления присвойте им какие-нибудь значения. Значениями могут быть любые строки.
        String name1 = "Паша";
        String name2 = "Никита";
        String name3 = "Миша";
        //Напиши программу, которая выводит на экран надпись: «Когда я вырасту, то хочу быть паровым экскаватором!» 10 раз.
        for (int i = 1; i <= 10; i++){
            System.out.println("Когда я вырасту, то хочу быть паровым экскаватором!");
        }
        //Код ниже раскоментируем позже.
        System.out.println("Happy New Year"); */



        //Задание: вывести на экран текст
      /*  String longStr = """
                Я согласен на зарплату $10/месяц в первый год.
                Я согласен на зарплату $20/месяц во второй год.
                Я согласен на зарплату $30/месяц в третий год.
                Я согласен на зарплату $40/месяц в четвертый год.
                Я согласен на зарплату $50/месяц в пятый год.""";
        System.out.println("Меня зовут Амиго.");
        System.out.println(longStr);
        System.out.println("Спасибо за щедрость, друг Риша!"); */

        // написать программу, которая выводит на экран строки:

     /*   int salary [] = {800, 1500, 2200, 2700, 3200};
        String years [] = {"в первый", "во второй", "в третий", "в четвертый", "в пятый" };
        for (int i = 0; i <= 4; i++){
            System.out.println("Я согласен на зарплату $" + salary[i] + "/месяц " + years[i] + " год" );
}
        System.out.println("Поцелуй мой блестящий металлический зад!"); */



        /*Условие
1	Переставьте строки так, чтобы получился текст "Nothing personal, it's just business."
2	Объявите недостающие переменные и закоментарьте те, которые нигде не используются. */
        // На сайте нет шаблона для этих заданий, могу выполнить только задание 3.
        for (int i = 0; i < 16; i++){
            System.out.println("Слава Роботам! Убить всех человеков!");
        }

    }
}

