


public class Main {

    public static void main(String[] args) {
            /* Объявите переменные name1, name2, name3 типа String.
            Сразу же в строке объявления присвойте им какие-нибудь значения. Значениями могут быть любые строки. */
        String name1 = "Паша";
        String name2 = "Никита";
        String name3 = "Миша";
        //Напиши программу, которая выводит на экран надпись: «Когда я вырасту, то хочу быть паровым экскаватором!» 10 раз.
        for (int i = 1; i <= 10; i++){
            System.out.println("Когда я вырасту, то хочу быть паровым экскаватором!");
        }
        //Код ниже раскоментируем позже.
        //System.out.println("Happy New Year");
    }
}

